kylefoxaustin/mcxn947qemu/hw/misc/mcxn_smartdma.c
/*
 * NXP MCX N SMARTDMA (programmable DMA coprocessor) - bring-up model.  See
 * header for design notes.  Offsets and bits from the MCXN947 CMSIS header
 * (SMARTDMA_Type).
 *
 * SPDX-License-Identifier: GPL-2.0-or-later
 */
#include "qemu/osdep.h"
#include "qemu/log.h"
#include "hw/misc/mcxn_smartdma.h"
#include "hw/core/irq.h"
#include "qom/object.h"
#include "migration/vmstate.h"

/* Register offsets (CMSIS SMARTDMA_Type). */
#define R_BOOTADR     0x20  /* RW: boot address */
#define R_CTRL        0x24  /* RW: control (START in bit 0) */
#define R_PC          0x28  /* RO: program counter */
#define R_SP          0x2C  /* RO: stack pointer */
#define R_BREAK_ADDR  0x30  /* RW */
#define R_BREAK_VECT  0x34  /* RW */
#define R_EMER_VECT   0x38  /* RW */
#define R_EMER_SEL    0x3C  /* RW */
#define R_ARM2EZH     0x40  /* RW: ARM-to-EZH interrupt control */
#define R_EZH2ARM     0x44  /* RW: EZH-to-ARM trigger (W1C-style status) */
#define R_PENDTRAP    0x48  /* RW: pending trap control (STATUS is W1C) */

#define CTRL_START    (1u << 0)  /* start bit ignition (self-clears here) */

/* ARM2EZH[1:0] selects the EZH-to-ARM signalling mode. */
#define ARM2EZH_IE_MASK  0x3u

/* PENDTRAP.STATUS is the pending-trap request flag set (W1C). */
#define PENDTRAP_STATUS_MASK  0xFFu

static uint64_t mcxn_smartdma_read(void *opaque, hwaddr off, unsigned size)
{
    MCXNSmartDMAState *s = MCXN_SMARTDMA(opaque);
    uint32_t v = (off < MCXN_SMARTDMA_SIZE) ? s->regs[off >> 2] : 0;

    switch (off) {
    case R_CTRL:
        /*
         * START reads back exactly as the engine's real state: still SET, because
         * the EZH program was never executed and therefore never completed.
         *
         * Clearing it (the old behaviour) told a polling guest "your transfer is
         * done" while the destination buffer had never been touched — a silent
         * wrong answer, and the worst kind, because SmartDMA's whole job is to
         * MOVE DATA to a pointer the guest gave us.  A boot-then-poll loop that
         * never falls through is a dead coprocessor, which is exactly what this
         * is; the guest can see that, and a LOG_UNIMP says why.
         */
        return v;
    case R_PC:
    case R_SP:
        /* Read-only engine state; nothing to model, report the boot address. */
        return s->regs[R_BOOTADR >> 2];
    default:
        return v;
    }
}

static void mcxn_smartdma_write(void *opaque, hwaddr off,
                                uint64_t value, unsigned size)
{
    MCXNSmartDMAState *s = MCXN_SMARTDMA(opaque);
    uint32_t v = value;

    if (off >= MCXN_SMARTDMA_SIZE) {
        qemu_log_mask(LOG_GUEST_ERROR, "%s: OOB write @0x%" HWADDR_PRIx "\n",
                      __func__, off);
        return;
    }

    switch (off) {
    case R_PC:
    case R_SP:
        return;                 /* read-only engine state */
    case R_CTRL:
        /* Reflect control back but immediately retire the START request.  The
         * EZH program is NOT executed (no SmartDMA core modelled): flag it so a
         * guest trusting the result is detectable, not silently wrong. */
        if (v & CTRL_START) {
            s->programs_started++;
            qemu_log_mask(LOG_UNIMP,
                          "%s: SmartDMA program START — the EZH core is NOT "
                          "modelled, so the program does not run and NOTHING IS "
                          "MOVED.  START stays set (the engine never completes) "
                          "rather than reporting a transfer that did not happen; "
                          "the destination buffer is untouched.  "
                          "compute-modelled=false, programs-started=%u\n",
                          __func__, s->programs_started);
        }
        s->regs[off >> 2] = v;   /* START stays set: it never finished */
        return;
    case R_EZH2ARM:
        /*
         * Writing EZH2ARM is the engine-to-ARM trigger; when ARM2EZH[1:0] == 2h
         * it would raise the ARM interrupt.  Latch the value but keep the line
         * deasserted (no real engine is running to drive it).
         */
        s->regs[off >> 2] = v;
        qemu_set_irq(s->irq, 0);
        return;
    case R_PENDTRAP:
        /* STATUS field (bits 7:0) is write-1-to-clear; other fields reflect. */
        s->regs[off >> 2] = (s->regs[off >> 2] & ~(v & PENDTRAP_STATUS_MASK))
                          | (v & ~PENDTRAP_STATUS_MASK);
        return;
    default:
        s->regs[off >> 2] = v;
        return;
    }
}

static const MemoryRegionOps mcxn_smartdma_ops = {
    .read = mcxn_smartdma_read,
    .write = mcxn_smartdma_write,
    .endianness = DEVICE_LITTLE_ENDIAN,
    .valid.min_access_size = 1,
    .valid.max_access_size = 4,
    .impl.min_access_size = 1,
    .impl.max_access_size = 4,
};

static void mcxn_smartdma_reset(DeviceState *dev)
{
    MCXNSmartDMAState *s = MCXN_SMARTDMA(dev);

    memset(s->regs, 0, sizeof(s->regs));
    s->programs_started = 0;
    qemu_set_irq(s->irq, 0);
}

/* Honesty marker: the SmartDMA EZH program is never executed. */
static bool mcxn_smartdma_compute_modelled(Object *obj, Error **errp)
{
    return false;
}

static void mcxn_smartdma_init(Object *obj)
{
    MCXNSmartDMAState *s = MCXN_SMARTDMA(obj);

    /* Farm-control-plane visibility (qom-get): is the engine actually computing,
     * and how many program starts were acked-but-not-executed. */
    object_property_add_bool(obj, "compute-modelled",
                             mcxn_smartdma_compute_modelled, NULL);
    object_property_add_uint32_ptr(obj, "programs-started",
                                   &s->programs_started, OBJ_PROP_FLAG_READ);
}

static void mcxn_smartdma_realize(DeviceState *dev, Error **errp)
{
    MCXNSmartDMAState *s = MCXN_SMARTDMA(dev);

    memory_region_init_io(&s->iomem, OBJECT(s), &mcxn_smartdma_ops, s,
                          TYPE_MCXN_SMARTDMA, MCXN_SMARTDMA_SIZE);
    sysbus_init_mmio(SYS_BUS_DEVICE(dev), &s->iomem);
    sysbus_init_irq(SYS_BUS_DEVICE(dev), &s->irq);
}

static const VMStateDescription vmstate_mcxn_smartdma = {
    .name = TYPE_MCXN_SMARTDMA,
    .version_id = 2,
    .minimum_version_id = 2,
    .fields = (const VMStateField[]) {
        VMSTATE_UINT32_ARRAY(regs, MCXNSmartDMAState, MCXN_SMARTDMA_SIZE / 4),
        VMSTATE_UINT32(programs_started, MCXNSmartDMAState),
        VMSTATE_END_OF_LIST()
    },
};

static void mcxn_smartdma_class_init(ObjectClass *klass, const void *data)
{
    DeviceClass *dc = DEVICE_CLASS(klass);

    dc->realize = mcxn_smartdma_realize;
    device_class_set_legacy_reset(dc, mcxn_smartdma_reset);
    dc->vmsd = &vmstate_mcxn_smartdma;
}

static const TypeInfo mcxn_smartdma_types[] = {
    {
        .name          = TYPE_MCXN_SMARTDMA,
        .parent        = TYPE_SYS_BUS_DEVICE,
        .instance_size = sizeof(MCXNSmartDMAState),
        .instance_init = mcxn_smartdma_init,
        .class_init    = mcxn_smartdma_class_init,
    },
};

DEFINE_TYPES(mcxn_smartdma_types)
